---
kind: type
id: T:Autodesk.Revit.DB.SpecTypeId.Reference
source: html/a5674b4f-6ba6-dab9-d58e-448c5638620f.htm
---
# Autodesk.Revit.DB.SpecTypeId.Reference

This class contains constants identifying reference specs.

## Syntax (C#)
```csharp
public static class Reference
```